storage/Fluid_Data/rans/ConvDivChannel/Re7900_kOmega_100_ml/0/cellCenters
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      cellCenters;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<vector> 
14000
(
(0.04547716073229 0.0032984659388385 4.70553353525929e-18)
(0.136431475784883 0.00329846593922766 -9.63735264551171e-20)
(0.227385789348204 0.00329846593892888 2.35276684467735e-18)
(0.318340106689758 0.00329846593899835 0)
(0.409293862326446 0.00333816325051593 7.34763551324588e-18)
(0.500246011741945 0.00356118164336403 0)
(0.591194881683689 0.00417763462134781 -2.45074220898019e-18)
(0.682135905936853 0.00539998595903331 -9.64250670428334e-20)
...
)
;

boundaryField
{
    bottomWall
    {
        type            sliced;
        value           nonuniform List<vector> 
140
(
(0.0454786806562763 0 0)
(0.136436035540532 0 0)
(0.227393388931727 0 0)
(0.318350746110766 0 0)
(0.409307999321001 3.97986955746345e-05 0)
(0.500264844702316 0.000263392565000469 0)
(0.591219632991405 0.000881452833912789 0)
(0.682167793019352 0.00210702434512261 0)
...
)
;
    }
    topWall
    {
        type            sliced;
        value           nonuniform List<vector> 
140
(
(0.04487964425 2 0)
(0.13463893275 2 0)
(0.22439822125 2 0)
(0.31415750975 2 0)
(0.40391679825 2 0)
(0.49367608675 2 0)
(0.58343537525 2 0)
(0.67319466375 2 0)
...
)
;
    }
    inlet
    {
        type            sliced;
        value           nonuniform List<vector> 
100
(
(0 0.0032985026864361 0)
(0 0.0100542093615704 0)
(0 0.0171349542582751 0)
(0 0.0245563759841101 0)
(0 0.0323348655690587 0)
(0 0.0404876026669287 0)
(0 0.0490325934985165 0)
(0 0.057988710620335 0)
...
)
;
    }
    outlet
    {
        type            sliced;
        value           nonuniform List<vector> 
100
(
(12.56630039 0.0032985026864361 0)
(12.56630039 0.0100542093615704 0)
(12.56630039 0.0171349542582751 0)
(12.56630039 0.0245563759841101 0)
(12.56630039 0.0323348655690587 0)
(12.56630039 0.0404876026669287 0)
(12.56630039 0.0490325934985165 0)
(12.56630039 0.057988710620335 0)
...
)
;
    }
    frontAndBack
    {
        type            sliced;
        value           nonuniform List<vector> 0();
    }
}


// ************************************************************************* //
