storage/Fluid_Data/rans/ConvDivChannel/Re7900_kOmega_100_ml/0/grad(U)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "0";
    object      grad(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<tensor> 
14000
(
(-0.016563079831453 0.000661412797741484 0 26.6214300553427 0.0164366333028228 7.39861386751961e-21 0 0 0)
(-0.0329513784433952 0.000131822565340308 0 26.2140310531671 0.0386619490708215 -7.41804667481214e-21 0 0 0)
(-0.0470811698930265 -3.58803277548721e-05 0 25.4394815402217 0.048853180186152 0 0 0 0)
(-0.0555083148336159 0.000392221297643489 0 24.4255895953632 0.0582316329101591 0 0 0 0)
(-0.0781557830109077 0.00144866769879246 -8.97054781106601e-22 23.2001668420404 0.0831717413797105 1.03023771022609e-18 0 0 0)
(-0.138214991452466 0.00246954219389748 -1.46691605317372e-18 21.9739859712614 0.143210800505684 -8.11301295935013e-21 0 0 0)
(-0.23600188522609 0.00221810694614505 2.39366251024247e-20 20.9461964209861 0.243647731627176 -2.37637288504994e-18 3.90155909188346e-18 4.53777379342669e-20 -4.42395423237616e-37)
(-0.373598277822866 -0.000708234650812611 1.468973026695e-18 20.1706079631821 0.384187342316392 -6.43282313681735e-20 0 0 0)
...
)
;

boundaryField
{
    bottomWall
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
140
(
(-0.016563079831453 0.000661412797741484 0 27.1276865634464 0.0134406964053929 0 0 0 0)
(-0.0329513784433952 0.000131822565340308 0 26.489369378217 0.0230358670635508 0 0 0 0)
(-0.0470811698930265 -3.58803277548721e-05 0 25.3104357079746 0.0207106403239991 0 0 0 0)
(-0.0555083148336159 0.000392221297643489 0 23.8928680584773 0.0210570862520251 0 0 0 0)
(-0.077324055458059 0.00148439657364468 4.51517059627436e-24 22.2497391079815 0.0423438122700387 3.95126483692407e-27 0 0 0)
(-0.133078417763418 0.00262404580135185 -1.46692488200463e-18 20.7029923909043 0.104980434291882 -5.92840740438576e-21 0 0 0)
(-0.222413498103769 0.00253441020541953 7.74306634390058e-19 19.5232118431886 0.210524252305976 -8.09555994883387e-17 3.90155909188346e-18 4.53777379342669e-20 -4.42395423237616e-37)
(-0.348241104416784 -0.0002150271768537 1.46740918927365e-18 18.7134830292246 0.355845661782419 2.55361420307533e-20 0 0 0)
...
)
;
    }
    topWall
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
140
(
(0.00446011449536284 6.47362089403126e-05 0 -27.6824221284717 -0.00245269296319772 0 0 0 0)
(0.00980786158752578 1.76486634269322e-05 0 -28.1011117411801 -0.00409043072408241 0 0 0 0)
(0.0121869526669882 6.13007143066714e-06 0 -28.6737383103299 -0.00423650745601198 0 0 0 0)
(0.0139285417202418 8.56389141910838e-06 0 -29.3328912966436 -0.00471001930115925 0 0 0 0)
(0.0155747141913744 7.43114052108118e-06 0 -30.0815465949179 -0.00510209105623997 0 0 0 0)
(0.0170637624991247 7.29804680243589e-06 0 -30.9070842099542 -0.0054611116552367 0 0 0 0)
(0.018527988361544 7.63049442616123e-06 0 -31.8062430272434 -0.00583973114492409 0 0 0 0)
(0.0200150595937133 7.9613383166254e-06 0 -32.7797752666368 -0.00623235343233096 0 0 0 0)
...
)
;
    }
    inlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
100
(
(-0.00997753297872507 0.000974855918302293 0 26.6214300553427 0.0164366333028228 7.39861386751961e-21 0 0 0)
(-0.012326820136346 0.00386183103109909 2.19835068627138e-21 22.8367033250059 0.0192945273103936 3.38960570726725e-22 -3.47599486356046e-21 -4.06685407653178e-24 1.72699346675298e-45)
(-0.00966708943732794 0.00684477527549625 0 15.6823651500127 0.0175077869493298 -7.05931430267185e-21 0 0 0)
(-0.00650647082372689 0.00943343659439831 0 9.65582262856447 0.0139641155899248 0 0 0 0)
(-0.00482095206905983 0.0114983152925226 0 6.38793078846236 0.0108633554267873 3.64776845474393e-25 0 0 0)
(-0.00395002302714219 0.0132304203820821 0 4.61840180483437 0.00893671428142407 3.92116868680235e-19 0 0 0)
(-0.00341620124094496 0.0147748328294817 0 3.5473668563001 0.00775692368469432 -3.30399646745281e-19 0 0 0)
(-0.00305533360187201 0.0162130175625094 0 2.84056710590391 0.0069819128590242 0 0 0 0)
...
)
;
    }
    outlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
100
(
(0 0 0 28.0371920611265 -0.0192378021013735 -2.02832920888455e-22 -1.3040478464405e-21 4.43781860396912e-25 1.21503335521794e-43)
(0 0 0 23.5540538246257 -0.015822946898439 6.62789125495316e-22 -5.85625554379502e-19 3.97900833859205e-22 -5.46317271943028e-42)
(0 0 0 15.5651695498857 -0.0124367301473831 -1.21997404924924e-21 5.5878278404686e-19 -3.79662625812143e-22 5.21276238555986e-42)
(0 0 0 9.17773242456966 -0.0100470520559194 7.36779637729237e-22 0 0 0)
(0 0 0 5.82026681258961 -0.00913419584429793 4.34104204816174e-24 0 0 0)
(0 0 0 4.02540351835922 -0.00921194978739262 1.98876152780124e-25 -1.29889210418204e-20 6.96010322013006e-24 -6.44970927413849e-48)
(0 0 0 2.96519813878151 -0.00964627655211464 -2.44050496468726e-22 0 0 0)
(0 0 0 2.2926796321579 -0.0101467228353727 1.83528212967608e-22 8.35078150718312e-19 -9.27343340798537e-22 -5.28396251286671e-43)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
