storage/Fluid_Data/rans/ConvDivChannel/Re7900_kOmega_100_ml/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
14000
(
0.000263595163761844
0.000252253821354005
0.000232603168168316
0.000209998539840998
0.000185486942457383
0.000164085464789006
0.000148749728196885
0.000138639450134014
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform 1e-15;
    }
    topWall
    {
        type            fixedValue;
        value           uniform 1e-15;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
100
(
0.000124123
0.000190478
0.001175732
0.002978653
0.004378990
0.005227472
0.005735598
0.006046354
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
