storage/Fluid_Data/rans/ConvDivChannel/Re7900_kOmega_100_ml/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
14000
(
4.51373325760331e-07
4.31965804753625e-07
3.98336448566873e-07
3.59647407871813e-07
3.17671823714922e-07
2.80943405838298e-07
2.5445393074278e-07
2.36698253158869e-07
...
)
;

boundaryField
{
    bottomWall
    {
        type            nutkWallFunction;
        blending        stepwise;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    topWall
    {
        type            nutkWallFunction;
        blending        stepwise;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.000000133
0.000001148
0.000018023
0.000079249
0.000175055
0.000289902
0.000417389
0.000554495
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
5.10751750838458e-07
6.52068446695876e-06
6.47143589532499e-05
0.000173780853921288
0.000316729206851101
0.000492925155031738
0.000702390035572632
0.00094373229349248
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
