storage/Fluid_Data/rans/ConvDivChannel/Re7900_kOmega_100_ml/0/turbulenceProperties:R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      turbulenceProperties:R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor> 
14000
(
(0.000175745023389693 -1.20165019646703e-05 -0 0.00017571523300916 -3.33953694739883e-27 0.000175730071124836)
(0.000168199326487575 -1.13236219625584e-05 -0 0.000168137457470274 3.20434250158518e-27 0.000168170858750161)
(0.000155106757641754 -1.01334584376721e-05 -0 0.000155030329345142 -0 0.000155069249349735)
(0.000140039606359947 -8.7847410450861e-06 -0 0.000139957793805192 -0 0.000139999679516857)
(0.000123708679704263 -7.37049951211126e-06 2.84969028286324e-28 0.000123606181286486 -3.27277492267408e-25 0.000123659023924017)
(0.000109468906733284 -6.17414026020398e-06 4.12120392057497e-25 0.000109310777292317 2.27929749241007e-27 0.000109391245552411)
(9.9287885689754e-05 -5.33040641946151e-06 -9.98857815301006e-25 9.90437882289789e-05 5.93130877725927e-25 9.91677824750371e-05)
(9.26048311508758e-05 -4.7741800321329e-06 -3.47703349356203e-25 9.2246098085764e-05 1.52263799936462e-26 9.24279710313881e-05)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (6.66666666666667e-16 -0 -0 6.66666666666667e-16 -0 6.66666666666667e-16);
    }
    topWall
    {
        type            fixedValue;
        value           uniform (6.66666666666667e-16 0 -0 6.66666666666667e-16 -0 6.66666666666667e-16);
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<symmTensor> 
100
(
(0.000177366385613396 -1.21279693311257e-05 -0 0.000177342319403026 -3.37047544642234e-27 0.000177357294983577)
(0.000419486995087503 -0.00012446814848903 6.96243740417817e-27 0.000419142358206363 -1.82498114942842e-27 0.000419352646706134)
(0.00191604730303573 -0.0008699954560582 -0 0.00191303350959579 3.91451921126511e-25 0.00191497518736848)
(0.00299773477068129 -0.00142528135225709 -0 0.00299169740449287 -0 0.00299581582482584)
(0.00350999529514431 -0.00164655420540607 -0 0.00350192424316531 -9.38560048424012e-29 0.00350751446169037)
(0.00377120577396453 -0.00175360844231984 -0 0.00376144753313737 -1.48461582841143e-22 0.0037682146928981)
(0.00391304979905111 -0.00181159961186329 -0 0.00390168515915464 1.68031460856847e-22 0.00390957504179425)
(0.00399072258222093 -0.00184418530369244 -0 0.00397776355729586 -0 0.00398677786048322)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
