storage/Fluid_Data/rans/ConvDivChannel/Re7900_kOmega_100_ml/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
        (0   0.0    -.1  )//0
        (12.56630039   0.0    -.1  )//1
        (12.56630039   1.3    -.1  )//2
        (0   1.3    -.1  )//3
        (0   0.0     .1  )//4
        (12.56630039   0.0     .1  )//5
        (12.56630039   1.3     .1  )//6
        (0   1.3     .1  )//7
        (12.56630039   2.0  -.1  )//8
        (0   2.0  -.1  )//9
        (0   2.0   .1  )//10
        (12.56630039   2.0   .1  )//11
);

blocks
(
        //hex (0 1 3 2 6 7 9 8) (40 25 30) simpleGrading (1 10.7028 1)
        hex (0 1 2 3 4 5 6 7)   (140 50 1) simpleGrading (1 10 1)
        hex (3 2 8 9 7 6 11 10) (140 50 1) simpleGrading (1 .1 1)
);


//EDGES-START
edges
(
spline 0 1 (
(0.0 0.0 -.1)
(0.00817935355 0.0 -.1)
(0.01635867916 0.0 -.1)
(0.02453809045 0.0 -.1)
(0.0327173695 0.0 -.1)
(0.04089676961 0.0 -.1)
(0.04907618091 0.0 -.1)
(0.05725545064 0.0 -.1)
(0.0654348582 0.0 -.1)
(0.07361414284 0.0 -.1)
(0.08179354668 0.0 -.1)
(0.08997295052 0.0 -.1)
(0.0981522277 0.0 -.1)
(0.1063316017 0.0 -.1)
(0.1145109013 0.0 -.1)
(0.1226902977 0.0 -.1)
(0.1308691949 0.0 -.1)
(0.1390486062 0.0 -.1)
(0.1472280025 0.0 -.1)
(0.1554073989 0.0 -.1)
(0.1635867953 0.0 -.1)
(0.1717662066 0.0 -.1)
(0.179945603 0.0 -.1)
(0.1881249994 0.0 -.1)
(0.1963045001 0.0 -.1)
(0.2044838965 0.0 -.1)
(0.2126632929 0.0 -.1)
(0.2208427042 0.0 -.1)
(0.2290221006 0.0 -.1)
(0.237201497 0.0 -.1)
(0.2453808933 0.0 -.1)
(0.2535603046 0.0 -.1)
(0.261739701 0.0 -.1)
(0.2699190974 0.0 -.1)
(0.2780984938 0.0 -.1)
(0.2862778902 0.0 -.1)
(0.2944572866 0.0 -.1)
(0.3026367128 0.0 -.1)
(0.3108161092 0.0 -.1)
(0.3189955056 0.0 -.1)
(0.327174902 0.0 -.1)
(0.3353531063 0.0 -.1)
(0.3435325027 0.0 -.1)
(0.351711899 0.0 -.1)
(0.3598912954 0.0 -.1)
(0.3680706918 0.0 -.1)
(0.3762500882 0.0 -.1)
(0.3844295144 0.0 -.1)
(0.3926089108 0.0 -.1)
(0.4007883072 0.0 -.1)
(0.4089677036 0.0 -.1)
(0.4171471 0.0 -.1)
(0.4253264964 0.0 -.1)
(0.4335058928 0.0 -.1)
(0.442075312 0.000056038 -.1)
(0.450261891 0.000070589 -.1)
(0.458448470 0.000087415 -.1)
(0.466635048 0.000106663 -.1)
(0.474821627 0.000128480 -.1)
(0.483008206 0.000153012 -.1)
(0.491194785 0.000180407 -.1)
(0.499381363 0.000210810 -.1)
(0.507567942 0.000244370 -.1)
(0.515754521 0.000281245 -.1)
(0.523941100 0.000321592 -.1)
(0.532127678 0.000365572 -.1)
(0.540314257 0.000413343 -.1)
(0.548500836 0.000465063 -.1)
(0.556687415 0.000520892 -.1)
(0.564873993 0.000580989 -.1)
(0.573060572 0.000645513 -.1)
(0.581247151 0.000714623 -.1)
(0.589433730 0.000788478 -.1)
(0.597620308 0.000867239 -.1)
(0.605806887 0.000951064 -.1)
(0.613993466 0.001040113 -.1)
(0.622180045 0.001134546 -.1)
(0.630366623 0.001234522 -.1)
(0.638553202 0.001340201 -.1)
(0.646739781 0.001451740 -.1)
(0.654926360 0.001569278 -.1)
(0.663112938 0.001692953 -.1)
(0.671299517 0.001822900 -.1)
(0.679486096 0.001959256 -.1)
(0.687672675 0.002102156 -.1)
(0.695859313 0.002251738 -.1)
(0.704045892 0.002408136 -.1)
(0.712232471 0.002571489 -.1)
(0.720419049 0.002741950 -.1)
(0.728605628 0.002919696 -.1)
(0.736792207 0.003104906 -.1)
(0.744978786 0.003297757 -.1)
(0.753165364 0.003498428 -.1)
(0.761351943 0.003707096 -.1)
(0.769538522 0.003923939 -.1)
(0.777725101 0.004149136 -.1)
(0.785911679 0.004382855 -.1)
(0.794098258 0.004625224 -.1)
(0.802284837 0.004876355 -.1)
(0.810471416 0.005136360 -.1)
...
)
spline 4 5 (
(0.0 0.0 .1)
(0.00817935355 0.0 .1)
(0.01635867916 0.0 .1)
(0.02453809045 0.0 .1)
(0.0327173695 0.0 .1)
(0.04089676961 0.0 .1)
(0.04907618091 0.0 .1)
(0.05725545064 0.0 .1)
(0.0654348582 0.0 .1)
(0.07361414284 0.0 .1)
(0.08179354668 0.0 .1)
(0.08997295052 0.0 .1)
(0.0981522277 0.0 .1)
(0.1063316017 0.0 .1)
(0.1145109013 0.0 .1)
(0.1226902977 0.0 .1)
(0.1308691949 0.0 .1)
(0.1390486062 0.0 .1)
(0.1472280025 0.0 .1)
(0.1554073989 0.0 .1)
(0.1635867953 0.0 .1)
(0.1717662066 0.0 .1)
(0.179945603 0.0 .1)
(0.1881249994 0.0 .1)
(0.1963045001 0.0 .1)
(0.2044838965 0.0 .1)
(0.2126632929 0.0 .1)
(0.2208427042 0.0 .1)
(0.2290221006 0.0 .1)
(0.237201497 0.0 .1)
(0.2453808933 0.0 .1)
(0.2535603046 0.0 .1)
(0.261739701 0.0 .1)
(0.2699190974 0.0 .1)
(0.2780984938 0.0 .1)
(0.2862778902 0.0 .1)
(0.2944572866 0.0 .1)
(0.3026367128 0.0 .1)
(0.3108161092 0.0 .1)
(0.3189955056 0.0 .1)
(0.327174902 0.0 .1)
(0.3353531063 0.0 .1)
(0.3435325027 0.0 .1)
(0.351711899 0.0 .1)
(0.3598912954 0.0 .1)
(0.3680706918 0.0 .1)
(0.3762500882 0.0 .1)
(0.3844295144 0.0 .1)
(0.3926089108 0.0 .1)
(0.4007883072 0.0 .1)
(0.4089677036 0.0 .1)
(0.4171471 0.0 .1)
(0.4253264964 0.0 .1)
(0.4335058928 0.0 .1)
(0.442075312 0.000056038 .1)
(0.450261891 0.000070589 .1)
(0.458448470 0.000087415 .1)
(0.466635048 0.000106663 .1)
(0.474821627 0.000128480 .1)
(0.483008206 0.000153012 .1)
(0.491194785 0.000180407 .1)
(0.499381363 0.000210810 .1)
(0.507567942 0.000244370 .1)
(0.515754521 0.000281245 .1)
(0.523941100 0.000321592 .1)
(0.532127678 0.000365572 .1)
(0.540314257 0.000413343 .1)
(0.548500836 0.000465063 .1)
(0.556687415 0.000520892 .1)
(0.564873993 0.000580989 .1)
(0.573060572 0.000645513 .1)
(0.581247151 0.000714623 .1)
(0.589433730 0.000788478 .1)
(0.597620308 0.000867239 .1)
(0.605806887 0.000951064 .1)
(0.613993466 0.001040113 .1)
(0.622180045 0.001134546 .1)
(0.630366623 0.001234522 .1)
(0.638553202 0.001340201 .1)
(0.646739781 0.001451740 .1)
(0.654926360 0.001569278 .1)
(0.663112938 0.001692953 .1)
(0.671299517 0.001822900 .1)
(0.679486096 0.001959256 .1)
(0.687672675 0.002102156 .1)
(0.695859313 0.002251738 .1)
(0.704045892 0.002408136 .1)
(0.712232471 0.002571489 .1)
(0.720419049 0.002741950 .1)
(0.728605628 0.002919696 .1)
(0.736792207 0.003104906 .1)
(0.744978786 0.003297757 .1)
(0.753165364 0.003498428 .1)
(0.761351943 0.003707096 .1)
(0.769538522 0.003923939 .1)
(0.777725101 0.004149136 .1)
(0.785911679 0.004382855 .1)
(0.794098258 0.004625224 .1)
(0.802284837 0.004876355 .1)
(0.810471416 0.005136360 .1)
...
);
//EDGES-END
//EDGES-END
//EDGES-END


boundary
(
    bottomWall
    {
        type            wall;
        faces           ((4 0 1 5));
    }
    
    topWall
    {
        type            wall;
        faces           ((10 11 8 9));
    }

    inlet
    {
        type            patch;
        faces
	(
	 (7 3 0 4)
	 (7 10 9 3)
	);
    }

    outlet
    {
        type            patch;
        faces
	(
	 (6 5 1 2)
	 (11 6 2 8)
	);
    }

    frontAndBack
    {
        type            empty;
        faces
	(
	 (6 7 4 5)
	 (10 7 6 11)
	 (0 3 2 1)
	 (3 9 8 2)
	);
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
